// Atoi - функция стандартной библиотеки C++,
// которая конвертирует строки в числа int32 (целые 32-битные числа со знаком).
// Напишите функцию myAtoi(s), которая принимает строку s и возвращает полученное из неё числовое значение.
// Правила считывания числового значения в переданной строке:
// 1. Читайте символы строки по одному, слева-направо.
// 2. Игнорируйте пробелы в начале строки.
// 3. Определите знак числа, проверяя наличие символов "-" или "+".
// Если этих символов нет, считайте, что знак положительный.
// 4. Остановите конверсию при обнаружении нецифрового символа. Если цифр не было найдено, возвращайте 0.
// Обратите внимание, что символы "+" и "-" также останавливают конверсию после повторного обнаружения.
// 5. Если результат выходит за пределы диапазона [-2^31, 2^31 - 1],
// округлите число, чтобы оно оставалось в диапазоне.

function task22() {

}

task22();
